cli/tcpdump.html
<!DOCTYPE html>
<html>
<head>
<title>Tcpdump</title>
<!-- 2018-02-06 Tue 10:51 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Tcpdump</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本语法</a>
<ul>
<li><a href="#sec-1-1">1.1. 过滤主机</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. 指定源地址</a></li>
<li><a href="#sec-1-1-2">1.1.2. 指定目的地址</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 过滤端口</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. 指定源端口</a></li>
<li><a href="#sec-1-2-2">1.2.2. 指定目的端口</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. 过滤网络</a></li>
<li><a href="#sec-1-4">1.4. 过滤协议</a></li>
<li><a href="#sec-1-5">1.5. 表达式</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 包头过滤</a>
<ul>
<li><a href="#sec-2-1">2.1. 基本语法</a></li>
<li><a href="#sec-2-2">2.2. IP</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. 过滤 IP Option</a></li>
<li><a href="#sec-2-2-2">2.2.2. 过滤大于 x 字节的数据包</a></li>
<li><a href="#sec-2-2-3">2.2.3. 过滤分片</a>
<ul>
<li><a href="#sec-2-2-3-1">2.2.3.1. 基本原理</a></li>
<li><a href="#sec-2-2-3-2">2.2.3.2. 过滤不分片的包</a></li>
<li><a href="#sec-2-2-3-3">2.2.3.3. 过滤分片包</a></li>
<li><a href="#sec-2-2-3-4">2.2.3.4. 测试分片</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. TCP</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. 过滤源端口</a></li>
<li><a href="#sec-2-3-2">2.3.2. 过滤特殊标记</a>
<ul>
<li><a href="#sec-2-3-2-1">2.3.2.1. 过滤 SYN 包</a></li>
<li><a href="#sec-2-3-2-2">2.3.2.2. 过滤 SYN-ACK 包</a></li>
<li><a href="#sec-2-3-2-3">2.3.2.3. 过滤 PSH-ACK 包</a></li>
<li><a href="#sec-2-3-2-4">2.3.2.4. 过滤 FIN 包 ( FIN 通常和 ACK 一起 )</a></li>
<li><a href="#sec-2-3-2-5">2.3.2.5. 过滤 RST 包</a></li>
<li><a href="#sec-2-3-2-6">2.3.2.6. 握手特征码</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. 常见用法</a>
<ul>
<li><a href="#sec-3-1">3.1. 抓 HTTP GET 数据</a></li>
<li><a href="#sec-3-2">3.2. 指定抓包数量</a></li>
<li><a href="#sec-3-3">3.3. 从 pcap 文件读取内容</a></li>
<li><a href="#sec-3-4">3.4. 抓取 GRE 隧道数据</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-02-06 10:51:42</td>
</tr>
</tbody>
</table>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基本语法</a>
<ul>
<li><a href="#sec-1-1">1.1. 过滤主机</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. 指定源地址</a></li>
<li><a href="#sec-1-1-2">1.1.2. 指定目的地址</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 过滤端口</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. 指定源端口</a></li>
<li><a href="#sec-1-2-2">1.2.2. 指定目的端口</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. 过滤网络</a></li>
<li><a href="#sec-1-4">1.4. 过滤协议</a></li>
<li><a href="#sec-1-5">1.5. 表达式</a></li>
</ul>
</li>
<li><a href="#sec-2">2. 包头过滤</a>
<ul>
<li><a href="#sec-2-1">2.1. 基本语法</a></li>
<li><a href="#sec-2-2">2.2. IP</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. 过滤 IP Option</a></li>
<li><a href="#sec-2-2-2">2.2.2. 过滤大于 x 字节的数据包</a></li>
<li><a href="#sec-2-2-3">2.2.3. 过滤分片</a>
<ul>
<li><a href="#sec-2-2-3-1">2.2.3.1. 基本原理</a></li>
<li><a href="#sec-2-2-3-2">2.2.3.2. 过滤不分片的包</a></li>
<li><a href="#sec-2-2-3-3">2.2.3.3. 过滤分片包</a></li>
<li><a href="#sec-2-2-3-4">2.2.3.4. 测试分片</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. TCP</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. 过滤源端口</a></li>
<li><a href="#sec-2-3-2">2.3.2. 过滤特殊标记</a>
<ul>
<li><a href="#sec-2-3-2-1">2.3.2.1. 过滤 SYN 包</a></li>
<li><a href="#sec-2-3-2-2">2.3.2.2. 过滤 SYN-ACK 包</a></li>
<li><a href="#sec-2-3-2-3">2.3.2.3. 过滤 PSH-ACK 包</a></li>
<li><a href="#sec-2-3-2-4">2.3.2.4. 过滤 FIN 包 ( FIN 通常和 ACK 一起 )</a></li>
<li><a href="#sec-2-3-2-5">2.3.2.5. 过滤 RST 包</a></li>
<li><a href="#sec-2-3-2-6">2.3.2.6. 握手特征码</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. 常见用法</a>
<ul>
<li><a href="#sec-3-1">3.1. 抓 HTTP GET 数据</a></li>
<li><a href="#sec-3-2">3.2. 指定抓包数量</a></li>
<li><a href="#sec-3-3">3.3. 从 pcap 文件读取内容</a></li>
<li><a href="#sec-3-4">3.4. 抓取 GRE 隧道数据</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基本语法</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 过滤主机</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> 指定源地址</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">

<pre class="src src-bash">tcpdump -i eth1 src host 192.168.1.1
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> 指定目的地址</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">

<pre class="src src-bash">tcpdump -i eth1 dst host 192.168.1.1
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 过滤端口</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 指定源端口</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 src port 25
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> 指定目的端口</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 dst port 25
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 过滤网络</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 net 192.168
tcpdump -i eth1 src net 192.168
tcpdump -i eth1 dst net 192.168
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 过滤协议</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 arp
tcpdump -i eth1 ip
tcpdump -i eth1 tcp
tcpdump -i eth1 udp
tcpdump -i eth1 icmp
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 表达式</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>与 : &amp;&amp; (and)
</li>
<li>非 : !  (not)
</li>
<li>或 : || (or)
</li>
</ul>


<div class="org-src-container">

<pre class="src src-sh"><span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#25235;&#21462;&#25152;&#26377;&#32463;&#36807; eth1 &#65292;&#30446;&#30340;&#22320;&#22336;&#26159; 192.168.1.254 &#25110; 192.168.1.200 &#31471;&#21475;&#26159; 80 &#30340; TCP &#25968;&#25454;</span>
tcpdump -i eth1 <span style="color: #00afaf;">'((tcp) and (port 80) and ((dst host 192.168.1.254) or (dst host 192.168.1.200)))'</span>

<span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#25235;&#21462;&#25152;&#26377;&#32463;&#36807; eth1 &#65292;&#30446;&#26631; MAC &#22320;&#22336;&#26159; 00:01:02:03:04:05 &#30340; ICMP &#25968;&#25454;</span>
tcpdump -i eth1 <span style="color: #00afaf;">'((icmp) and ((ether dst host 00:01:02:03:04:05)))'</span>

<span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">&#25235;&#21462;&#25152;&#26377;&#32463;&#36807; eth1 &#65292;&#30446;&#30340;&#32593;&#32476;&#26159; 192.168 &#65292;&#20294;&#30446;&#30340;&#20027;&#26426;&#19981;&#26159; 192.168.1.200 &#30340; TCP &#25968;&#25454;</span>
tcpdump -i eth1 <span style="color: #00afaf;">'((tcp) and ((dst net 192.168) and (not dst host 192.168.1.200)))'</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 包头过滤</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 基本语法</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-sh">proto[x:y]          : &#36807;&#28388;&#20174;x&#23383;&#33410;&#24320;&#22987;&#30340;y&#23383;&#33410;&#25968;&#12290;&#27604;&#22914;ip[2:2]&#36807;&#28388;&#20986;3&#12289;4&#23383;&#33410;&#65288;&#31532;&#19968;&#23383;&#33410;&#20174;0&#24320;&#22987;&#25490;&#65289;
proto[x:y] &amp; z = 0  : proto[x:y]&#21644;z&#30340;&#19982;&#25805;&#20316;&#20026;0
proto[x:y] &amp; z !=0  : proto[x:y]&#21644;z&#30340;&#19982;&#25805;&#20316;&#19981;&#20026;0
proto[x:y] &amp; z = z  : proto[x:y]&#21644;z&#30340;&#19982;&#25805;&#20316;&#20026;z
proto[x:y] = z      : proto[x:y]&#31561;&#20110;z
</pre>
</div>

<p>
操作符 : &gt;, &lt;, &gt;=, &lt;=, =, !=
</p>
</div>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> IP</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> 过滤 IP Option</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>通常 IP 头是 20 字节，但 IP 头有选项设置，不能直接从偏移 21 字节处读取数据
</li>
<li>IP 头有个长度字段( IHL )可以知道头长度是否大于 20 字节
</li>
<li>IHL (4 bits) 表示 IP 头 32 bit 的块数, 通常为 5 ( = 5 * 32 bits = 160 bits or 20 bytes)
</li>
</ul>

<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 <span style="color: #00afaf;">'ip[0] &amp; 0x0f &gt; 5'</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> 过滤大于 x 字节的数据包</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 <span style="color: #00afaf;">'ip[2:2] &gt; 600'</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> 过滤分片</h4>
<div class="outline-text-4" id="text-2-2-3">
</div><div id="outline-container-sec-2-2-3-1" class="outline-5">
<h5 id="sec-2-2-3-1"><span class="section-number-5">2.2.3.1</span> 基本原理</h5>
<div class="outline-text-5" id="text-2-2-3-1">
<p>
当发送端的 MTU 大于到目的路径链路上的 MTU 时就会被分片
</p>

<p>
分片信息在 IP 头的第七和第八字节：
</p>

<pre class="example">
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
|Flags|      Fragment Offset    |
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
</pre>

<ul class="org-ul">
<li>Bit 0:  保留，必须是0
</li>
<li>Bit 1:  (DF) 0 = 分片, 1 = 不分片
</li>
<li>Bit 2:  (MF) 0 = 最后的分片, 1 = 还有分片
</li>
</ul>

<p>
<code>Fragment Offset</code> 字段只有在分片的时候才使用。
</p>
</div>
</div>

<div id="outline-container-sec-2-2-3-2" class="outline-5">
<h5 id="sec-2-2-3-2"><span class="section-number-5">2.2.3.2</span> 过滤不分片的包</h5>
<div class="outline-text-5" id="text-2-2-3-2">
<p>
要抓带 DF 位标记的不分片的包，第七字节的值应该是： <b>01000000 = 64</b>
</p>

<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 <span style="color: #00afaf;">'ip[6] = 64'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-3-3" class="outline-5">
<h5 id="sec-2-2-3-3"><span class="section-number-5">2.2.3.3</span> 过滤分片包</h5>
<div class="outline-text-5" id="text-2-2-3-3">
<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 <span style="color: #00afaf;">'((ip[6:2] &gt; 0) and (not ip[6] = 64))'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-3-4" class="outline-5">
<h5 id="sec-2-2-3-4"><span class="section-number-5">2.2.3.4</span> 测试分片</h5>
<div class="outline-text-5" id="text-2-2-3-4">
<p>
TCP 发送数据时，会将大于 MSS 的数据分段( segment 不叫分片)。
</p>

<p>
MSS 往往基于 MTU 计算出来，通常 <b>MSS = MTU-sizeof(IP Header)-sizeof(TCP Header) = 1500-20-20 = 1460</b> 。
</p>

<p>
这样，数据经过本地 TCP 层分段后，交给本地 IP 层，在本地 IP 层就不需要分片了。但是在下一跳路由 (Next Hop) 的邻居路由器上可能发生 IP 分片!
</p>

<div class="org-src-container">

<pre class="src src-sh">ping -M want -s 3000 192.168.1.1
</pre>
</div>
</div>
</div>
</div>
</div>




<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> TCP</h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> 过滤源端口</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 <span style="color: #00afaf;">'tcp[0:2] &gt; 1024'</span>
tcpdump -i eth1 <span style="color: #00afaf;">'portrange 21-23'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> 过滤特殊标记</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
TCP 标记定义在 TCP 头的第十四个字节
</p>

<pre class="example">
+-+-+-+-+-+-+-+-+
|C|E|U|A|P|R|S|F|
|W|C|R|C|S|S|Y|I|
|R|E|G|K|H|T|N|N|
+-+-+-+-+-+-+-+-+
</pre>
</div>

<div id="outline-container-sec-2-3-2-1" class="outline-5">
<h5 id="sec-2-3-2-1"><span class="section-number-5">2.3.2.1</span> 过滤 SYN 包</h5>
<div class="outline-text-5" id="text-2-3-2-1">
<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 <span style="color: #00afaf;">'tcp[13] = 2'</span>
tcpdump -i eth1 <span style="color: #00afaf;">'tcp[tcpflags] = tcp-syn'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-2-2" class="outline-5">
<h5 id="sec-2-3-2-2"><span class="section-number-5">2.3.2.2</span> 过滤 SYN-ACK 包</h5>
<div class="outline-text-5" id="text-2-3-2-2">
<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 <span style="color: #00afaf;">'tcp[13] &amp; 2 = 2'</span>
tcpdump -i eth1 <span style="color: #00afaf;">'tcp[tcpflags] &amp; tcp-syn != 0 and tcp[tcpflags] &amp; tcp-ack != 0'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-2-3" class="outline-5">
<h5 id="sec-2-3-2-3"><span class="section-number-5">2.3.2.3</span> 过滤 PSH-ACK 包</h5>
<div class="outline-text-5" id="text-2-3-2-3">
<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 <span style="color: #00afaf;">'tcp[13] = 24'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-2-4" class="outline-5">
<h5 id="sec-2-3-2-4"><span class="section-number-5">2.3.2.4</span> 过滤 FIN 包 ( FIN 通常和 ACK 一起 )</h5>
<div class="outline-text-5" id="text-2-3-2-4">
<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 <span style="color: #00afaf;">'tcp[13] &amp; 1 = 1'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-2-5" class="outline-5">
<h5 id="sec-2-3-2-5"><span class="section-number-5">2.3.2.5</span> 过滤 RST 包</h5>
<div class="outline-text-5" id="text-2-3-2-5">
<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 <span style="color: #00afaf;">'tcp[13] &amp; 4 = 4'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-3-2-6" class="outline-5">
<h5 id="sec-2-3-2-6"><span class="section-number-5">2.3.2.6</span> 握手特征码</h5>
<div class="outline-text-5" id="text-2-3-2-6">
<pre class="example">
SYN=1, FIN=0, RST=0, ACK=0 # 第一次握手
SYN=1, FIN=0, RST=0, ACK=1 # 第二次握手
SYN=0, FIN=0, RST=0, ACK=1 # ESTABLISHED
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 常见用法</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 抓 HTTP GET 数据</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sh">tcpdump -i eth1 <span style="color: #00afaf;">'tcp[(tcp[12]&gt;&gt;2):4] = 0x47455420'</span>
<span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">"GET "&#30340;&#21313;&#20845;&#36827;&#21046;&#26159;47455420</span>
<span style="color: #585858; font-style: italic;"># </span><span style="color: #585858; font-style: italic;">DATA Offset &#21333;&#20301;&#20026; 32 bits = 4 bytes&#65292;&#25152;&#20197;&#38656;&#35201;&#21491;&#31227;2&#20301;(*4)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 指定抓包数量</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #5f8700;">time</span> tcpdump -nn -i eth0 <span style="color: #00afaf;">'tcp[tcpflags] = tcp-syn'</span> -c 10000 &gt; /dev/null
<span style="color: #585858; font-style: italic;">## </span><span style="color: #585858; font-style: italic;">&#35745;&#31639;&#25235; 10000 &#20010; SYN &#21253;&#33457;&#36153;&#22810;&#23569;&#26102;&#38388;&#65292;&#21487;&#20197;&#21028;&#26029;&#35775;&#38382;&#37327;&#22823;&#27010;&#26159;&#22810;&#23569;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 从 pcap 文件读取内容</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-sh">tcpdump -nvvvs 0 -X -r data.pcap
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 抓取 GRE 隧道数据</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-sh">tcpdump <span style="color: #00afaf;">'protochain GRE'</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>